Revit 2025 API
HVACLoadLoadsReportType Enumeration
 Enumerated type listing possible types of reports generated for HVAC loads.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum HVACLoadLoadsReportType
Public Enumeration HVACLoadLoadsReportType
public enum class HVACLoadLoadsReportType
type HVACLoadLoadsReportType
Members
Member name | Value | Description
NoReport | 0 |  No report
SimpleReport | 1 |  A simple report with summaries
StandardReport | 2 |  A standard report including zones and spaces
DetailedReport | 3 |  A detailed report including orientation breakdowns
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace